app/Controllers/Cart.php

    public function add()
    {
        if ($this->request->isAJAX()) {
            $productId = $this->request->getPost('product_id');
            $sessionId = session_id();

            // Get product details
            $product = $this->productModel->find($productId);
            if (!$product) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'Product not found'
                ]);
            }

            // Check if product already exists in cart
            $existingItem = $this->cartModel->where([
                'session_id' => $sessionId,
                'product_id' => $productId
            ])->first();

            if ($existingItem) {
                // Update quantity
                $this->cartModel->updateQuantity($sessionId, $productId, $existingItem['quantity'] + 1);
            } else {
                // Add new item
                $this->cartModel->insert([
                    'product_id' => $productId,
                    'name' => $product['name'],
                    'price' => $product['price'],
                    'img_path' => $product['img_path'],
                    'quantity' => 1,
                    'session_id' => $sessionId
                ]);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '2'
INSERT INTO `cart_items` (`product_id`, `name`, `price`, `img_path`, `quantity`, `session_id`, `created_at`, `updated_at`) VALUES ('2', 'Air Jordan 1 Mid', '129.99', 'https://images.unsplash.com/photo-1552346154-21d32810aba3', 1, '4cc92546441b7e82529d8c9507ec9b13', '2025-06-05 11:06:41', '2025-06-05 11:06:41')