app/Models/ProductModel.php

    public function getProducts()
    {
        return $this->findAll();
---
SELECT *
FROM `products`